#Использовать json
#Использовать cmdline
#Использовать 1commands
#Использовать tempfiles
#Использовать fs


Функция ПолучитьТекстФайла(ФайлИмя)
	Перем оФайл, оТекст, ТекстФайла;

	ТекстФайла = "";
	Сообщить("Получаем текст файла - "  + ФайлИмя);
	оФайл = Новый Файл(ФайлИмя);
	Если оФайл.Существует() Тогда
		оТекст = Новый ЧтениеТекста(ФайлИмя, КодировкаТекста.UTF8);
		ТекстФайла = оТекст.Прочитать();
		оТекст.Закрыть();
		ОсвободитьОбъект(оТекст);
	КонецЕсли;
	Возврат ТекстФайла;
КонецФункции



PATTERN_NUM = "\s*м_сОбработка_Версия\s*=\s*\""(\d{1,2}-\d{2}-\d{3})""\s*;";
PATTERN_DATE = "\s*м_сОбработка_Дата\s*=\s*\""(\d{2}.\d{2}.\d{4})\""\s*;";

ИмяФайла = "E:\TEMP\ObjectModule.bsl";
ТекстФайла = ПолучитьТекстФайла(ИмяФайла);

reNum =  Новый РегулярноеВыражение(PATTERN_NUM);
Результат = reNum.НайтиСовпадения(ТекстФайла);
// reg = new RegExGroup();
Если Результат.Количество() = 0 Тогда
	Сообщить("При посике номера релиза совпадений не найдено!")
ИначеЕсли Результат.Количество() > 1 Тогда
	Сообщить("При поиске номера релиза найдено более одного совпадения!")
Иначе
	Сообщить(Результат[0].Значение);
	Сообщить(Результат[0].Группы[1].Значение);
	РелизНомер = Результат[0].Значение;
КонецЕсли;

// Сообщить("Процесс завершен.")
